mathe/index.html
<p>
//#+HTML<sub>MATHJAX</sub>: align: left indent: 5em tagside: left
</p>
---
layout: page
title: Index
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Mathe</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Mengen

<ul class="org-ul">
<li>Gleichheit
</li>
<li>Kardinalität

<ul class="org-ul">
<li>Kardinalitätsvergleiche
</li>
</ul>
</li>

<li>Komplement
</li>
<li>beliebige Vereinigung
</li>
<li>beliebiger Schnitt
</li>
<li>Potenzmenge
</li>
</ul>
</li>

<li>Relationen

<ul class="org-ul">
<li>eindeutig
</li>
<li>total
</li>
<li><a href="./homogene_relationen.html">homogene Relationen</a>

<ul class="org-ul">
<li>reflexiv
</li>
<li>symmetrisch
</li>
<li>transitiv
</li>
<li>antisymmetrisch
</li>
<li>irreflexiv
</li>
<li>linear
</li>
<li>identische Relation
</li>
<li><a href="./division_mit_rest.html">Division mit Rest</a>
</li>
<li><a href="./modulorelation.html">Modulorelation</a>
</li>
<li><a href="./teilbarkeitsrelation.html">Teilbarkeitsrelation</a>
</li>
<li><a href="./ordnungsrelation.html">Ordnungsrelation</a> (reflexiv,
antisymmetrisch, transitiv)
</li>
<li><a href="./aequivalenzrelation.html">Äquivalenzrelation</a> (reflexiv,
symmetrisch, transitiv)
</li>
<li><a href="./aequivalenzklassen.html">Äquivalenzklassen</a>
</li>
</ul>
</li>
</ul>
</li>

<li>Funktionen

<ul class="org-ul">
<li>injektiv
</li>
<li>surjektiv
</li>
<li><a href="./bijektiv.html">./bijektiv.html</a>
</li>
<li>monoton
</li>
<li>Gleichheit
</li>
<li>Bild
</li>
<li>Urbild
</li>
<li><a href="./funktionskomposition.html">Funktionskomposition</a>
</li>
<li><a href="./abrundungsfunktion.html">Abrundungsfuktion</a>
</li>
<li><a href="./logarithmus.html">Logarithmusfunktion</a>
</li>
</ul>
</li>

<li>Listen

<ul class="org-ul">
<li>nichtleere Listen (\(M^{+}\))
</li>
<li>lineare Listen (\(M^{*}\))
</li>
<li>Listenoperationen

<ul class="org-ul">
<li>Konkatenation (&amp;)
</li>
<li>Kopf (\(kopf\))
</li>
<li>Rest (\(rest\))
</li>
<li>Länge
</li>
</ul>
</li>

<li>Listeninduktion
</li>
</ul>
</li>

<li>knotenmarkierte Binärbäume (\(\mathcal{B}(M)\))

<ul class="org-ul">
<li><a href="./bauminduktion.html">Bauminduktion</a>
</li>
</ul>
</li>

<li>Ordnungen

<ul class="org-ul">
<li>Hassee-Diagramme
</li>
<li><a href="./extreme_elemente.html">extreme Elemente</a>

<ul class="org-ul">
<li>kleinstes Element
</li>
<li>größtes Element
</li>
<li>minimales Element
</li>
<li>maximales Element
</li>
<li>Infimum
</li>
<li>Supremum
</li>
<li>obere Schranke
</li>
<li>untere Schranke
</li>
</ul>
</li>

<li>Noethersche Ordnung
</li>
</ul>
</li>

<li><a href="./vollstaendige_induktion.html">Vollständige Induktion</a>
</li>
<li>Fixpunktsatz von B. Knaster
</li>
<li>Satz von Schröder-Bernstein
</li>
<li>gerichtete Graphen
</li>
<li><a href="./permutation.html">Permutation</a>
</li>
<li><a href="./polynom.html">Polynom</a>

<ul class="org-ul">
<li>Horner-Schema
</li>
</ul>
</li>

<li>Algebra

<ul class="org-ul">
<li><a href="./gruppe.html">Gruppe</a>

<ul class="org-ul">
<li><a href="./gruppe.html">abelsche/kommutative Gruppe</a>
</li>
<li><a href="./gruppen.html">Homomorphismus/Isomorphismus</a>
</li>
<li><a href="./modulorelation.html">Prime Restklassengruppe</a>
</li>
<li>Anwendung: <a href="./rsa_kryptosystem.html">RSA Krypotsystem</a>
</li>
</ul>
</li>

<li><a href="./ring.html">Ring</a>

<ul class="org-ul">
<li><a href="./ring.html">Polynomring</a>
</li>
<li>Anwendung: Polynomdivision zur Datensicherung
</li>
</ul>
</li>

<li><a href="./koerper.html">Körper</a>

<ul class="org-ul">
<li>der Körper der primen Restklassen
</li>
<li>der Körper der reellen Zahlen
</li>
<li>der Körper der <a href="./komplexe_zahlen.html">komplexe Zahlen</a>
</li>
</ul>
</li>
</ul>
</li>

<li>Lineare Algebra

<ul class="org-ul">
<li><a href="./la/lineare_gleichungssysteme.html">lineare Gleichungssysteme</a>
</li>
<li><a href="./la/vektorraum.html">Vektorraum</a>

<ul class="org-ul">
<li><a href="./la/vektorraum.html">Euklidischer (Vektor-)Raum</a>
</li>
<li><a href="./la/vektorraum.html">Unitärer (Vektor-)Raum</a>
</li>
</ul>
</li>

<li><a href="./la/unterraum.html">Unterraum</a>
</li>
<li><a href="./la/span.html">Span</a>
</li>
<li><a href="./la/lineare_abhaengigkeit.html">lineare Abhängigkeit</a>
</li>
<li><a href="./la/lineare_abbildung.html">lineare Abbildung</a>
</li>
<li><a href="./la/bild.html">Bild</a>
</li>
<li><a href="./la/kern.html">Kern</a>
</li>
<li><a href="./la/span.html">Span</a>
</li>
<li><a href="./la/erzeugendensystem.html">Erzeugendensystem</a>
</li>
<li><a href="./la/dimension.html">Dimension</a>
</li>
<li><a href="./la/determinante.html">Determinante</a>
</li>
<li><a href="./la/matrix.html">Matrizen</a>

<ul class="org-ul">
<li>Dreiecksmatrix
</li>
<li>General Linear Group
</li>
<li><a href="./la/definitheit.html">Definitheit von Matrizen</a>
</li>
<li><a href="./la/eigenwert.html">Eigenwert</a>
</li>
<li><a href="./la/aehnlichkeit.html">Ähnlichkeit</a>
</li>
<li><a href="./la/diagonalisierbarkeit.html">Diagonalisierbarkeit</a>
</li>
</ul>
</li>

<li><a href="./la/skalarprodukt.html">Skalarprodukt</a>
</li>
<li><a href="./la/norm.html">Norm</a>

<ul class="org-ul">
<li><a href="./la/norm.html">Euklidische Norm</a>
</li>
</ul>
</li>
</ul>
</li>

<li>Analysis
<ul class="org-ul">
<li><a href="./analysis/metrik.html">metrische Räume</a>
</li>
<li><a href="./analysis/metrik.html">Metrik</a>
</li>
<li><a href="./folge.html">Folge</a>
<ul class="org-ul">
<li><a href="./grenzwert.html">Grenzwert/Limes</a>
</li>
</ul>
</li>
<li><a href="./reihe.html">Reihe</a>
</li>
<li><a href="./stetigkeit.html">Stetigkeit</a>
</li>
<li><a href="./potenzfunktion.html">Potenzfunktion</a>
</li>
<li><a href="./differenzierbarkeit.html">Differenzierbarkeit</a>
</li>
<li><a href="./integralrechnung.html">Integralrechnung</a>
</li>
<li>multivariate Analysis
<ul class="org-ul">
<li><a href="./multivariate_funktionen.html">multivariate Funktionen</a>
</li>
<li><a href="./multivariate_funktionen.html">multivariater Stetigkeitsbegriff</a>
</li>
</ul>
</li>
</ul>
</li>
<li><a href="./wahrscheinlichkeitsrechnung.html">Wahrscheinlichkeitsrechnung</a>
<ul class="org-ul">
<li><a href="./binomialverteilung.html">Binomialverteilung</a>
</li>
<li><a href="./erwartungswert.html">Erwartungswert</a>
</li>
<li><a href="./geometrische_verteilung.html">Geometrische Verteilung</a>
</li>
<li><a href="./sigma_algebra.html">Sigma Algebra</a>
</li>
<li><a href="./zva.html">Zufallsvariable</a>
</li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Übersicht über Berechnungsverfahren</h3>
<div class="outline-text-3" id="text-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Problem</th>
<th scope="col" class="left">Berechnungsverfahren</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Bild einer Matrix</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Kern einer Matrix</td>
<td class="left">löse \(Ax=0\)</td>
</tr>

<tr>
<td class="left">Determinante einer Matrix</td>
<td class="left">Entwicklungssatz von Laplace</td>
</tr>

<tr>
<td class="left">Eigenwerte einer Matrix</td>
<td class="left">Nullstellen des charakteristische Polynoms \(\det(A-\lambda I)\)</td>
</tr>

<tr>
<td class="left">Eigenvektoren einer Matrix zu Eigenwert \(\lambda\)</td>
<td class="left">Lösungsraum von \((A-\lambda I)\)</td>
</tr>

<tr>
<td class="left">Rang einer Matrix</td>
<td class="left">Herstellen der Zeilen-Stufenform</td>
</tr>

<tr>
<td class="left">Polynom</td>
<td class="left">Horner-Schema</td>
</tr>
</tbody>
</table>

<p>
<b>Unstetigkeit:</b> Zeige, dass eine Funktion \(f:D \rightarrow \mathbb{R}\)
in einem Punkt \(a \in D\) nicht stetig ist, indem du eine Folge
\((a_n)\_{n\in\mathbb{N} \subseteq D\) angibst für die
\(\lim\_{n\rightarrow\infty} a_n = a\) und
\(\lim\_{n\rightarrow\infty} f(a_n) \neq f(a)\) gilt.
</p>

<p>
<b>Stetigkeit:</b> Verwende das \(\epsilon\)-\(\delta\)-Kriterium
</p>
</div>
</div>
</div>
